---
kind: method
id: M:Autodesk.Revit.DB.HomeCamera.#ctor(Autodesk.Revit.DB.HomeCamera)
source: html/3b104f7a-7b5d-3244-77b6-14ab86774479.htm
---
# Autodesk.Revit.DB.HomeCamera.#ctor Method

Constructs a new copy of the input HomeCamera object.

## Syntax (C#)
```csharp
public HomeCamera(
	HomeCamera other
)
```

## Parameters
- **other** (`Autodesk.Revit.DB.HomeCamera`)

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null